Repository: SoftwareSavants/moosyl_flutter
Catalog: lib/l10n/*.arb
Languages: ar

# unknownError
source: An unknown error occurred
ar: حدث خطأ غير معروف

source: Copied this text
ar: تم نسخ هذا النص

source: Payment Method
ar: طريقة الدفع

source: Bankily
ar: بنكيلي

source: Sedad
ar: سداد

source: Bim Bank
ar: بيم بنك

source: Masrivi
ar: مصريفي

source: Amanty
ar: أمانتي

source: Pay using
ar: ادفع باستخدام {method}

source: Copy the code, BPay and head to Bankily to pay the amount
ar: 1- انسخ الرمز، BPay وتوجه إلى بنكيلي لدفع المبلغ

source: After payment
ar: بعد الدفع

source: After making the payment, fill the following information
ar: 2- بعد اتمام عملية الدفع قم بتحميل صورة من المعاملة

source: Enter your Bankily phone number
ar: رقم الهاتف الذي قمت بالدفع منه

source: Bankily Phone Number
ar: رقم هاتف بنكيلي

source: Payment Pass Code
ar: رمز المعاملة

source: Payment Pass Code from Bankily
ar: رمز المرور للدفع من بنكيلي

source: Send for verification
ar: أرسل للتحقق

source: Code BPay
ar: رمز BPay

source: Amount to pay
ar: المبلغ الواجب دفعه

source: Retry
ar: إعادة المحاولة

source: Upload
ar: تحميل

source: Capture
ar: التقاط

source: merchant code
ar: رمز التاجر

# existingPaymentWasFound
source: An existing pending payment was found. Please wait for the previous payment to be processed.
ar: تم العثور على دفعة معلقة موجودة. يرجى الانتظار حتى يتم معالجة الدفعة السابقة.

# authorizationRequired
source: API key is required
ar: مطلوب مفتاح API

# invalidAuthorizationOrganizationNotFound
source: Invalid API key, organization not found
ar: مفتاح API غير صالح، لم يتم العثور على المؤسسة

source: File not found
ar: الملف غير موجود

source: Authentication BPay failed
ar: فشل مصادقة BPay

source: Configuration not found
ar: لم يتم العثور على الإعدادات

source: Payment request not found
ar: لم يتم العثور على طلب الدفع

source: Payment not found
ar: لم يتم العثور على الدفعة

source: Error while creating payment
ar: حدث خطأ أثناء إنشاء الدفعة

source: Error while creating paymentRequest
ar: حدث خطأ أثناء إنشاء طلب الدفع

source: Organization not found
ar: لم يتم العثور على المؤسسة

# invalidAuthorization
source: Invalid API key
ar: مفتاح API غير صالح

source: Change
ar: تغيير

source: Sending...
ar: جاري الإرسال...

source: processing Error
ar: خطأ في المعالجة

source: Non-existent operation
ar: العملية غير موجودة

# phoneNumberRequired
source: Phone number is required
ar: رقم الهاتف مطلوب

# validMauritanianNumber
source: Enter a valid Mauritanian phone number
ar: أدخل رقم هاتف موريتاني صالح

# codeRequired
source: Code is required
ar: الرمز مطلوب

# validDigitCode
source: Enter a valid 4-digit code
ar: أدخل رمزًا صالحًا مكونًا من 4 أرقام
